
#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура ЗаполнитьГрафикРаботы(Команда)
	ЗаполнитьГрафикРаботыНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("График работы заполнен!");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикРаботыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафикРаботы(Период.ДатаНачала, Период.ДатаОкончания, ВыходныеДни);
КонецПроцедуры

#КонецОбласти
