
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафикРаботы(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();   
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы); 
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ПеремДатНачала = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата = ПеремДатНачала Тогда
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ПеремДатНачала))) Тогда
				Запись.Часы = 0; 
				Запись.Дни = 0; 
			Иначе	          
				Запись.Часы = 8;  
				Запись.Дни = 1; 
			КонецЕсли;
			ПеремДатНачала = ПеремДатНачала + ЧислоСекундВСутках;
		Иначе
			Пока ПеремДатНачала < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = ПеремДатНачала;
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ПеремДатНачала))) Тогда
					НоваяЗапись.Часы = 0; 
					НоваяЗапись.Дни = 0; 
				Иначе	          
					НоваяЗапись.Часы = 8; 
					Запись.Дни = 1; 
				КонецЕсли; 
				ПеремДатНачала = ПеремДатНачала + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ПеремДатНачала))) Тогда
					Запись.Часы = 0; 
					Запись.Дни = 0; 
				Иначе	          
					Запись.Часы = 8; 
					Запись.Дни = 1; 
				КонецЕсли;
			КонецЕсли;
			ПеремДатНачала = ПеремДатНачала + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока ПеремДатНачала <= ДатаОкончания Цикл
		Запись = Набор.Добавить();  
		Запись.Дата = ПеремДатНачала;   
		Запись.ГрафикРаботы = ГрафикРаботы; 
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ПеремДатНачала))) Тогда
			Запись.Часы = 0;  
			Запись.Дни = 0; 
		Иначе	          
			Запись.Часы = 8; 
			Запись.Дни = 1; 
		КонецЕсли; 
		ПеремДатНачала = ПеремДатНачала + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры   

#КонецОбласти

#КонецЕсли
