
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция  СоздатьАктыНаСервере(НачалоПериода, КонецПериода) Экспорт 
	
	ТабЗнач = ПолучитьДоговорыИРеализации(НачалоПериода, КонецПериода);
	
	МассивДляТЧ = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТабЗнач Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Реализация) Тогда 
			
			МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаТЗ.Договор, СоздатьНовыйДокРеализации(СтрокаТЗ, КонецПериода)));
			Продолжить;
			
		КонецЕсли;
		
		МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаТЗ.Договор, СтрокаТЗ.РеализацияТоваровУслуг));
		
	КонецЦикла;
	
	Возврат МассивДляТЧ;
	
КонецФункции

Функция  ПолучитьДоговорыИРеализации(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ вт_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДействуетС <= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДействуетПо >= &КонецПериода
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ПОМЕСТИТЬ вт_Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Договоры.Договор,
	|	вт_Реализация.Реализация
	|ИЗ
	|	вт_Договоры КАК вт_Договоры
	|		ПОЛНОЕ СОЕДИНЕНИЕ вт_Реализация КАК вт_Реализация
	|		ПО вт_Договоры.Договор.Ссылка = вт_Реализация.Реализация.Договор.Ссылка";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	ТабЗнач = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабЗнач;

КонецФункции

Функция СоздатьНовыйДокРеализации(СтрокаТЗ, Дата)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", СтрокаТЗ.Договор.Организация);
	ДанныеЗаполнения.Вставить("Контрагент", СтрокаТЗ.Договор.Владелец);
	ДанныеЗаполнения.Вставить("Договор", СтрокаТЗ.Договор);
	ДанныеЗаполнения.Вставить("Комментарий", "Документ создан групповой обработкой.");
	
	НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДок.Заполнить(ДанныеЗаполнения);
	НовыйДок.Дата = Дата;
	НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
	НовыйДок.ПроверитьЗаполнение();
	НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДок.Ссылка;

КонецФункции

Процедура ДобавитьСтрокуВТЧ(Договор, Реализация, ТабЧасть) Экспорт
	
	НоваяСтрокаТБ = ТабЧасть.Добавить();
	НоваяСтрокаТБ.Договор = Договор;
	НоваяСтрокаТБ.РеализацияТоваровУслуг = Реализация;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
