
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВКМ_Еговцева_Ольга_2024_06_19+
	
	Элемент = Элементы.Добавить("ВКМ_ДействуетС", Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Заголовок = "Действует с";
	Элемент.ПутьКДанным = "Объект.ВКМ_ДействуетС";
	Элемент.Видимость = Ложь;
	Элемент.Доступность = Ложь;
	
	Элемент = Элементы.Добавить("ВКМ_ДействуетПо", Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Заголовок = "Действует по";
	Элемент.ПутьКДанным = "Объект.ВКМ_ДействуетПо";
	Элемент.Видимость = Ложь;
	Элемент.Доступность = Ложь;
	
	Элемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Заголовок = "Сумма абонентской платы";
	Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	Элемент.Видимость = Ложь;
	Элемент.Доступность = Ложь;
	
	Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Заголовок = "Стоимость часа работы";
	Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	Элемент.Видимость = Ложь;
	Элемент.Доступность = Ложь;
		
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_ДействуетС.Видимость = Истина;
		Элементы.ВКМ_ДействуетС.Доступность = Истина;
		Элементы.ВКМ_ДействуетПо.Видимость = Истина;
		Элементы.ВКМ_ДействуетПо.Доступность = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Истина;
	КонецЕсли;
	//ВКМ_Еговцева_Ольга_2024_06_19-

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	//ВКМ_Еговцева_Ольга_2024_06_19+
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_ДействуетС.Видимость = Истина;
		Элементы.ВКМ_ДействуетС.Доступность = Истина;
		Элементы.ВКМ_ДействуетПо.Видимость = Истина;
		Элементы.ВКМ_ДействуетПо.Доступность = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Истина;
	Иначе 
		Объект.ВКМ_ДействуетС = '00010101';
		Объект.ВКМ_ДействуетПо = '00010101';
		Объект.ВКМ_СуммаАбонентскойПлаты = 0;
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		Элементы.ВКМ_ДействуетС.Видимость = Ложь;
		Элементы.ВКМ_ДействуетС.Доступность = Ложь;
		Элементы.ВКМ_ДействуетПо.Видимость = Ложь;
		Элементы.ВКМ_ДействуетПо.Доступность = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Ложь;
	КонецЕсли;
	//ВКМ_Еговцева_Ольга_2024_06_19-
КонецПроцедуры

#КонецОбласти
